package p2_intermediate.p3_advancedUsageOfClass.p9_summary

/*
本章有以下重点:
●嵌套类是定 义在类中的类。嵌套类和外部类都属于独立的类。
●内部类作为类成员的类，必须由外部类的对象来创建。
●对象声明即单例对象，该类的实例全局唯以
●伴生对象是定义在类中的单例对象，为类提供静态成员。
●数据类用于表示数据，其内置方法基于主构造方法中的属性。
●枚举类用于表示一组类型安全的常量。
表12-1是本章所有介绍的知识点与Java中类似功能的对比。


kotlin与java对比

-----------------------------------------------------------------------------------------------------------
知识点         |kotlin中的实现                 |java中的类似功能
-----------------------------------------------------------------------------------------------------------
内部类         |定义在类中的inner class         |定义在类中的类
-----------------------------------------------------------------------------------------------------------
对象表达式      |通过object扩展类或者接口         |通过匿名内部类来扩展类或者接口
-----------------------------------------------------------------------------------------------------------
单例对象        |使用object声明                 |需自行实现
-----------------------------------------------------------------------------------------------------------
伴生对象        |使用companion修饰的单例对象      |静态成员
-----------------------------------------------------------------------------------------------------------
数据类         |data class                     |自行实现Java Bean
-----------------------------------------------------------------------------------------------------------
枚举类         |enum class                     |enum
 */