package p1_introductory.p1_basicConcepts

/*
1.标识符
标识符（Identifier）是普通的字符，可以作为程序中变量、类、函数等成员的名字。

在kotlin中，定义一个标识符有以下几种规则：
    标识符可以由任意字符、数字、下划线组成，但不能以数字开头。

    标识符不能是kotlin中的硬关键字。在特定上下文中，也不能包含软关键字和修饰符关键字，但可以包含关键字。

    标识符不能包含空格。

    标识符只能包含下划线、不能包含@、#等特殊字符。




2.字面量
字面量（Literal）又叫直接量，即：数字3就表示数字3，字符a就表示字符a。
这一点和标识符正相反，标识符a可能表示字符a,有可能表示数字3，还可能表示方法。


3.关键字
关键字（key word）是kotlin内的保留字符，分为硬关键字、软关键字和修饰符关键字。

kotlin中的关键字非常多，官方文档（https://kotlinlang.org/docs/reference/keyword-reference.html）以获得所有关键字的详细信息。
 */